{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-07-31T14:37:54.1599841Z","creationSource":null,"description":"","lastModifiedDateTime":"2024-07-31T14:37:54.1599841Z","name":"Security Baseline - Local Security Authority Settings","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"1bdd1ff8-3663-4735-b0ee-fcc666146c86","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_localsecurityauthority_configurelsaprotectedprocess","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_localsecurityauthority_configurelsaprotectedprocess_1","children":[]}}}]}