{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2024-04-09T08:23:47.979715Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2024-04-09T08:23:47.979715Z",
  "name": "Baseline-Privacy",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "792f5c92-c57c-4540-9cc2-6b728975ac4a",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_privacy_letappsactivatewithvoiceabovelock",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_privacy_letappsactivatewithvoiceabovelock_2",
          "children": []
        }
      }
    }
  ]
}
