{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-02-17T14:45:04.955841Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2025-02-17T14:45:04.955841Z",
  "name": "Security Baseline 24H2 - Lanman Workstation",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "14b6cbf2-ecfc-4212-990c-5797e90a736b",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_lanmanworkstation_enableinsecureguestlogons",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_lanmanworkstation_enableinsecureguestlogons_0",
          "children": []
        }
      }
    }
  ]
}
